Revit 2027 API
AlignmentStationLabel.AlignmentId Property
 The ElementId of the Alignment on which the SpotDimension is placed.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AlignmentId { get; }
Public ReadOnly Property AlignmentId As ElementId
	Get
public:
property ElementId^ AlignmentId {
	ElementId^ get ();
}
member AlignmentId : ElementId with get
Property Value
ElementId
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace